# -*- coding:utf-8 -*-
# coding=<utf8>
from django.db import models
from django.core.validators import RegexValidator

METRO_CHOICES= (
    (-1,u'----'),
    (0,u'﻿Авиамоторная'),
    (1,u'Автозаводская'),
    (2,u'Академическая'),
    (3,u'Александровский сад'),
    (4,u'Алексеевская'),
    (5,u'Алма-Атинская'),
    (6,u'Алтуфьево'),
    (7,u'Аннино'),
    (8,u'Арбатская (Арбатско-Покровская линия)'),
    (9,u'Арбатская (Филевская линия)'),
    (10,u'Аэропорт'),
    (11,u'Бабушкинская'),
    (12,u'Багратионовская'),
    (13,u'Баррикадная'),
    (14,u'Бауманская'),
    (15,u'Беговая'),
    (16,u'Белорусская'),
    (17,u'Беляево'),
    (18,u'Бибирево'),
    (19,u'Библиотека имени Ленина'),
    (20,u'Борисово'),
    (21,u'Боровицкая'),
    (22,u'Ботанический сад'),
    (23,u'Братиславская'),
    (24,u'Бульвар адмирала Ушакова'),
    (25,u'Бульвар Дмитрия Донского'),
    (26,u'Бульвар Рокоссовского'),
    (27,u'Бунинская аллея'),
    (28,u'Варшавская'),
    (29,u'ВДНХ'),
    (30,u'Владыкино'),
    (31,u'Водный стадион'),
    (32,u'Войковская'),
    (33,u'Волгоградский проспект'),
    (34,u'Волжская'),
    (35,u'Волоколамская'),
    (36,u'Воробьевы горы'),
    (37,u'Выставочная'),
    (38,u'Выхино'),
    (39,u'Деловой центр'),
    (40,u'Динамо'),
    (41,u'Дмитровская'),
    (42,u'Добрынинская'),
    (43,u'Домодедовская'),
    (44,u'Достоевская'),
    (45,u'Дубровка'),
    (46,u'Жулебино'),
    (47,u'Зябликово'),
    (48,u'Измайловская'),
    (49,u'Калужская'),
    (50,u'Кантемировская'),
    (51,u'Каховская'),
    (52,u'Каширская'),
    (53,u'Киевская'),
    (54,u'Китай-город'),
    (55,u'Кожуховская'),
    (56,u'Коломенская'),
    (57,u'Комсомольская'),
    (58,u'Коньково'),
    (59,u'Красногвардейская'),
    (60,u'Краснопресненская'),
    (61,u'Красносельская'),
    (62,u'Красные ворота'),
    (63,u'Крестьянская застава'),
    (64,u'Кропоткинская'),
    (65,u'Крылатское'),
    (66,u'Кузнецкий мост'),
    (67,u'Кузьминки'),
    (68,u'Кунцевская'),
    (69,u'Курская'),
    (70,u'Кутузовская'),
    (71,u'Ленинский проспект'),
    (72,u'Лермонтовский проспект'),
    (73,u'Лубянка'),
    (74,u'Люблино'),
    (75,u'Марксистская'),
    (76,u'Марьина роща'),
    (77,u'Марьино'),
    (78,u'Маяковская'),
    (79,u'Медведково'),
    (80,u'Международная'),
    (81,u'Менделеевская'),
    (82,u'Митино'),
    (83,u'Молодежная'),
    (84,u'Монорельса Выставочный центр'),
    (85,u'Монорельса Телецентр'),
    (86,u'Монорельса Улица Академика Королева'),
    (87,u'Монорельса Улица Милашенкова'),
    (88,u'Монорельса Улица Сергея Эйзенштейна'),
    (89,u'Монорельсовой дороги Тимирязевская'),
    (90,u'Мякинино'),
    (91,u'Нагатинская'),
    (92,u'Нагорная'),
    (93,u'Нахимовский проспект'),
    (94,u'Новогиреево'),
    (95,u'Новокосино'),
    (96,u'Новокузнецкая'),
    (97,u'Новослободская'),
    (98,u'Новоясеневская'),
    (99,u'Новые Черемушки'),
    (100,u'Октябрьская'),
    (101,u'Октябрьское поле'),
    (102,u'Орехово'),
    (103,u'Отрадное'),
    (104,u'Охотныйряд'),
    (105,u'Павелецкая'),
    (106,u'Парк культуры'),
    (107,u'Парк Победы'),
    (108,u'Партизанская'),
    (109,u'Первомайская'),
    (110,u'Перово'),
    (111,u'Петровско-Разумовская'),
    (112,u'Печатники'),
    (113,u'Пионерская'),
    (114,u'Планерная'),
    (115,u'Площадь Ильича'),
    (116,u'Площадь Революции'),
    (117,u'Полежаевская'),
    (118,u'Полянка'),
    (119,u'Пражская'),
    (120,u'Преображенская площадь'),
    (121,u'Пролетарская'),
    (122,u'Проспект Вернадского'),
    (123,u'Проспект Мира'),
    (124,u'Профсоюзная'),
    (125,u'Пушкинская'),
    (126,u'Пятницкое шоссе'),
    (127,u'Речной вокзал'),
    (128,u'Рижская'),
    (129,u'Римская'),
    (130,u'Рязанский проспект'),
    (131,u'Савеловская'),
    (132,u'Свиблово'),
    (133,u'Севастопольская'),
    (134,u'Семеновская'),
    (135,u'Серпуховская'),
    (136,u'Славянский бульвар'),
    (137,u'Смоленская (Арбатско-Покровская линия)'),
    (138,u'Смоленская (Филевская линия)'),
    (139,u'Сокол'),
    (140,u'Сокольники'),
    (141,u'Спартак'),
    (142,u'Спортивная'),
    (143,u'Сретенский бульвар'),
    (144,u'Строгино'),
    (145,u'Студенческая'),
    (146,u'Сухаревская'),
    (147,u'Сходненская'),
    (148,u'Таганская'),
    (149,u'Тверская'),
    (150,u'Театральная'),
    (151,u'Текстильщики'),
    (152,u'Теплый стан'),
    (153,u'Тимирязевская'),
    (154,u'Третьяковская'),
    (155,u'Тропарево'),
    (156,u'Трубная'),
    (157,u'Тульская'),
    (158,u'Тургеневская'),
    (159,u'Тушинская'),
    (160,u'Улица Академика Янгеля'),
    (161,u'Улица Горчакова'),
    (162,u'Улица Скобелевская'),
    (163,u'Улица Старокачаловская'),
    (164,u'Улица 1905 года'),
    (165,u'Университет'),
    (166,u'Филевский парк'),
    (167,u'Фили'),
    (168,u'Фрунзенская'),
    (169,u'Царицыно'),
    (170,u'Цветной бульвар'),
    (171,u'Черкизовская'),
    (172,u'Чертановская'),
    (173,u'Чеховская'),
    (174,u'Чистые пруды'),
    (175,u'Чкаловская'),
    (176,u'Шаболовская'),
    (177,u'Шипиловская'),
    (178,u'Шоссе Энтузиастов'),
    (179,u'Щелковская'),
    (180,u'Щукинская'),
    (181,u'Электрозаводская'),
    (182,u'Юго-Западная'),
    (183,u'Южная'),
    (184,u'Ясенево'),
)

DISTINCT_CHOICES = (
    (-1,u'----'),
    (0,u'Академический'),
    (1,u'Алексеевский'),
    (2,u'Алтуфьевский'),
    (3,u'Арбат'),
    (4,u'Аэропорт'),
    (5,u'Бабушкинский'),
    (6,u'Басманный'),
    (7,u'Беговой'),
    (8,u'Бескудниковский'),
    (9,u'Бибирево'),
    (10,u'Бирюлёво Восточное'),
    (11,u'Бирюлёво Западное'),
    (12,u'Богородское'),
    (13,u'Братеево'),
    (14,u'Бутырский'),
    (15,u'Вешняки'),
    (16,u'Внуково'),
    (17,u'Войковский'),
    (18,u'Восточное Дегунино'),
    (19,u'Восточное Измайлово'),
    (20,u'Восточный'),
    (21,u'Выхино-Жулебино'),
    (22,u'Гагаринский'),
    (23,u'Головинский'),
    (24,u'Гольяново'),
    (25,u'Даниловский'),
    (26,u'Дмитровский'),
    (27,u'Донской'),
    (28,u'Дорогомилово'),
    (29,u'Замоскворечье'),
    (30,u'Западное Дегунино'),
    (31,u'Зюзино'),
    (32,u'Зябликово'),
    (33,u'Ивановское'),
    (34,u'Измайлово'),
    (35,u'Капотня'),
    (36,u'Коньково'),
    (37,u'Коптево'),
    (38,u'Косино-Ухтомский'),
    (39,u'Котловка'),
    (40,u'Красносельский'),
    (41,u'Крылатское'),
    (42,u'Крюково'),
    (43,u'Кузьминки'),
    (44,u'Кунцево'),
    (45,u'Куркино'),
    (46,u'Левобережный'),
    (47,u'Лефортово'),
    (48,u'Лианозово'),
    (49,u'Ломоносовский'),
    (50,u'Лосиноостровский'),
    (51,u'Люблино'),
    (52,u'Марфино'),
    (53,u'Марьина Роща'),
    (54,u'Марьино'),
    (55,u'Матушкино'),
    (56,u'Метрогородок'),
    (57,u'Мещанский'),
    (58,u'Митино'),
    (59,u'Можайский'),
    (60,u'Молжаниновский'),
    (61,u'Москворечье-Сабурово'),
    (62,u'Нагатино-Садовники'),
    (63,u'Нагатинский Затон'),
    (64,u'Нагорный'),
    (65,u'Некрасовка'),
    (66,u'Нижегородский'),
    (67,u'Ново-Переделкино'),
    (68,u'Новогиреево'),
    (69,u'Новокосино'),
    (70,u'Обручевский'),
    (71,u'Орехово-Борисово Северное'),
    (72,u'Орехово-Борисово Южное'),
    (73,u'Останкинский'),
    (74,u'Отрадное'),
    (75,u'Очаково-Матвеевское'),
    (76,u'Перово'),
    (77,u'Печатники'),
    (78,u'Покровское-Стрешнево'),
    (79,u'Преображенское'),
    (80,u'Пресненский'),
    (81,u'Проспект Вернадского'),
    (82,u'Раменки'),
    (83,u'Ростокино'),
    (84,u'Рязанский'),
    (85,u'Савёлки'),
    (86,u'Савёловский'),
    (87,u'Свиблово'),
    (88,u'Северное Бутово'),
    (89,u'Северное Измайлово'),
    (90,u'Северное Медведково'),
    (91,u'Северное Тушино'),
    (92,u'Северный'),
    (93,u'Силино'),
    (94,u'Сокол'),
    (95,u'Соколиная Гора'),
    (96,u'Сокольники'),
    (97,u'Солнцево'),
    (98,u'Старое Крюково'),
    (99,u'Строгино'),
    (100,u'Таганский'),
    (101,u'Тверской'),
    (102,u'Текстильщики'),
    (103,u'Тёплый Стан'),
    (104,u'Тимирязевский'),
    (105,u'Тропарёво-Никулино'),
    (106,u'Филёвский Парк'),
    (107,u'Фили-Давыдково'),
    (108,u'Хамовники'),
    (109,u'Ховрино'),
    (110,u'Хорошёво-Мнёвники'),
    (111,u'Хорошёвский'),
    (112,u'Царицыно'),
    (113,u'Черёмушки'),
    (114,u'Чертаново Северное'),
    (115,u'Чертаново Центральное'),
    (116,u'Чертаново Южное'),
    (117,u'Щукино'),
    (118,u'Южное Бутово'),
    (119,u'Южное Медведково'),
    (120,u'Южное Тушино'),
    (121,u'Южнопортовый'),
    (122,u'Якиманка'),
    (123,u'Ярославский'),
    (124,u'Ясенево'),
)

class Person(models.Model):
    fio = models.CharField(max_length=200)
    phone_regex = RegexValidator(regex = r'^\d{10}$',
                                 message = "Phone number must be entered in the format: '9051112233'. Only 10 digits allowed.")
    tel = models.CharField(validators = [phone_regex], max_length=10)  # validators should be a list
    # Качество работы
    RATING_CHOICES = (
        (0, u'Руки из жопы'),
        (1, u'Нет отпыта'),
        (2, u'Норма'),
        (3, u'Хорош'),
        (4, u'Мастер от Б-га'),
    )
    rating = models.IntegerField(
        choices = RATING_CHOICES,
        default = 2,
    )
    # надёжность
    RELIABILITY_CHOICES = (
        (0, u'Ушлёпок'),
        (1, u'Не надёжный'),
        (2, u'Бывают проколы'),
        (3, u'Ответственный'),
        (4, u'Можно в разведку'),
    )
    reliability = models.IntegerField(
        choices = RELIABILITY_CHOICES,
        default = 2,
    )
    # район проживания
    home_distinct = models.IntegerField(
        choices = DISTINCT_CHOICES,
        default = -1,
    )

    # метро
    home_metro = models.IntegerField(
        choices = METRO_CHOICES,
        default = -1,
    )

    login = models.CharField(max_length=140, blank = True,
                             null = True)
    confirmed = models.BooleanField(default=False)
    category = models.ManyToManyField('Category',
                                    related_name = "who_do",
                                    blank = True)
    busy_days = models.ManyToManyField('Day',related_name="who_busy", blank=True)
    comment = models.TextField(blank = True, null = True)

    def rating_verbose (self):
        return dict(Person.RATING_CHOICES).get(self.rating,'')
    def reliability_verbose (self):
        return dict(Person.RELIABILITY_CHOICES).get(self.reliability,'')
    def home_distinct_verbose (self):
        return dict(DISTINCT_CHOICES).get(self.home_distinct,'')
    def home_metro_verbose (self):
        return dict(METRO_CHOICES).get(self.home_metro,'')

    def __unicode__(self):
        id = unicode(self.id)
        fio = self.fio
        t = id +u';'+ fio
        login = self.login
        return t+u";"+login
        # return self.fio+u";"+self.login
        # return unicode(self.id)+u";"+self.fio.decode('utf-8')+u";"+self.login.decode('utf-8')
        # return u";".join((self.fio.decode('utf-8'),self.login.decode('utf-8')))

    # def __str__(self):
    #     return ";".join((self.fio,str(self.login),str(self.busy)))

    class Meta:
        ordering = ['fio',]

class Day(models.Model):
    year = models.IntegerField()
    month = models.IntegerField()
    day = models.IntegerField()

    def __str__(self):
        return "/".join((str(self.day),str(self.month), str(self.year)))

    def __unicode__(self):
        return u"/".join((str(self.day),str(self.month), str(self.year)))


class Category(models.Model):
    name = models.CharField(max_length = 500)

    def __str__(self):
        return self.name

    def __unicode__(self):
        return u"{}".format(self.name)
